import re

# Задача 1 Валидация номера телефона:
s = "+7 499 456-45-78, +74994564578, 7 (499) 456 45 78, 7 (499) 456-45-78"
r = r'\+?7\ ?\(?\d{3}\)?\ ?\d{3}\-?\ ?\d{2}\-?\ ?\d{2}'


print(re.findall(r, s))


# 2 Задачу необходимо решить с использованием рекурсии:
# Вычислить количество отрицательных чисел в списке

# def negative(a):
#     if not a:  # len(a) == 0 a == []
#         return 0
#     else:
#         count = negative(a[1:])
#         if a[0] < 0:
#             count += 1
#         return count
#
#
# lst = [-2, 3, 8, -11, -4, 6]
# print(lst)
# n = negative(lst)
# print("n = ", n)  # 3
